0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v9012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (90 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    "leftSide|upperWall|ground"
    {
        type            slip;
    }
    
    rightSide
    {
        type            symmetry;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (90 0 0);
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    bod
    {
        //type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
       
    fluid_to_solid
    {
       //type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}


// ************************************************************************* //
