0.orig/fluid/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

//internalField   uniform 0;
internalField   uniform 1e-3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    "leftSide|upperWall|ground"
    {
        type            slip;
        //value           $internalField;
    }
    
    rightSide
    {
        type            symmetry;
    }
    
    inlet
    {
        type            fixedValue;
        //type            calculated;
        value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
        //type            calculated;
        //value           $internalField;
    }
    
    bod
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
        value           uniform 0;
    }
    
    fluid_to_solid
    {
        type            calculated;
        value           $internalField;
    }

}


// ************************************************************************* //
