0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 84559;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    "leftSide|upperWall|ground"
    {
        type            slip;
        //type            fixedValue;
        //value           $internalField;
    }
    
    rightSide
    {
        type            symmetry;
    }
    
    inlet
    {
        type            zeroGradient;
        //type            fixedFluxPressure;
        //value           $internalField;
    }
    
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    bod
    {
        type            zeroGradient;
        //type            fixedFluxPressure;
        //value           $internalField;
    }
       
    fluid_to_solid
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           $internalField;
    }
    
}


// ************************************************************************* //
