system/fluid/blockMeshDict.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -6.0   0.0  -2.5)    //0
    ( -6.0  -4.0  -2.5)    //1
    ( 18.0  -4.0  -2.5)    //2
    ( 18.0   0.0  -2.5)    //3
    ( -6.0   0.0   3.5)    //4
    ( -6.0  -4.0   3.5)    //5
    ( 18.0  -4.0   3.5)    //6
    ( 18.0   0.0   3.5)    //7
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (10 60 15) simpleGrading (1 1 1) 
    hex (0 1 2 3 4 5 6 7) (10 60 15) simpleGrading (1 1 1)   
);

edges
(
);

boundary
(
    rightSide
    {
	type symmetry;
	faces
        (
            (1 5 6 2)
	);
    }
    leftSide
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    ground
    {
        //type wall;
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

);

// ************************************************************************* //