system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.1  0.1  -0.1)    //0
    (-0.1 -2.6  -0.1)    //1
    ( 8.1 -2.6  -0.1)    //2
    ( 8.1  0.1  -0.1)    //3
    (-0.1  0.1   2.6)    //4
    (-0.1 -2.6   2.6)    //5
    ( 8.1 -2.6   2.6)    //6
    ( 8.1  0.1   2.6)    //7
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) fluid (20 64 20) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) fluid (10 32 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	rightSide
	{
		//type patch;
		type symmetry;
		faces
		(
			(0 4 7 3)
		);
	}
	leftSide
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
	ground
    {
        //type wall;
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
	outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
	inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

);

// ************************************************************************* //
