system/solid/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bod {
    surfaces ("simple-bod.stl");
    includedAngle    150;
    subsetFeatures {
        nonManifoldEdges     no;
        openEdges           yes;
        }
}

radiator {
    surfaces ("radiator.stl");
    includedAngle    150;
    subsetFeatures {
        nonManifoldEdges     no;
        openEdges           yes;
        }
}


// ************************************************************************* //
